README_SOUNDFEATURES.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Sound Features</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-12-30 15:28:03 EET"/>
<meta name="author" content="I Z"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="content">

<h1 class="title">Sound Features</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 About this GIT branch "soundfeatures" </a></li>
<li><a href="#sec-2">2 Usage scenario: Segmenting audio files by onsets </a></li>
<li><a href="#sec-3">3 Kinds of data involved </a></li>
<li><a href="#sec-4">4 User Interface Requirements: Preliminary Study </a>
<ul>
<li><a href="#sec-4_1">4.1 Step 1: Analysis of the sound files </a></li>
<li><a href="#sec-4_2">4.2 Step 2: Define and name segments to work with </a></li>
<li><a href="#sec-4_3">4.3 Step 3: Specify segments by name to use in a piece </a>
<ul>
<li><a href="#sec-4_3_1">4.3.1 3.1. Loading sound files and their segments </a></li>
<li><a href="#sec-4_3_2">4.3.2 3.2. Selecting a segment from a file/segment list </a></li>
<li><a href="#sec-4_3_3">4.3.3 3.3. Inserting a segment as code for use in a piece </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-5">5 Data Structures: First Draft </a>
<ul>
<li><a href="#sec-5_1">5.1 Object structure of the user data </a>
<ul>
<li><a href="#sec-5_1_1">5.1.1 Onset Data </a></li>
<li><a href="#sec-5_1_2">5.1.2 Segment data </a></li>
<li><a href="#sec-5_1_3">5.1.3 Tag data (Optional, to be considered) </a></li>
<li><a href="#sec-5_1_4">5.1.4 (Also optional, for later:) Onset group tags, Segment group tags </a></li>
<li><a href="#sec-5_1_5">5.1.5 Metadata </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-6">6 Draft of data and file / folder structures </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> About this GIT branch "soundfeatures" </h2>
<div class="outline-text-2" id="text-1">


<p>
This branch contains work on an interface for analysing sound files, storing the obtained features in files, retrieving the analysis files, and using them for synthesis. 
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Usage scenario: Segmenting audio files by onsets </h2>
<div class="outline-text-2" id="text-2">


<p>
The main first objective is to support the division of one or more sound files into segments, so as to be able to play selectively a segment of a file instead of the whole file. The segments should be "perceptually coherent", meaning that they contain sound objects that are perceived as belonging together. What constitutes an entire object or a group of objects that belong together depends on the deliberately predefined level of grouping. For example, in a file containing speech the level of grouping may be that of phonemes, words, phrases, sentences or paragraphs. In this case, depending on the selected level of grouping, a segment will hold a complete phoneme, word, phrase or sentence, but it should not start or end arbitrarily in the middle of a phoneme, word, phrase or sentence. 
</p>
<p>
Starting with a sound file sf, the goals are: 
</p>
<ol>
<li>
Find appropriate positions in sf that correspond to boundaries (beginnings / ends) of segments according to user-selected criteria. 
</li>
<li>
Allow the user to define and name segments by specifying the beginning and end of each segment, and then to use these segments for synthesis in a piece. 
</li>
</ol>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Kinds of data involved </h2>
<div class="outline-text-2" id="text-3">


<p>
The following kinds of data are involved in the analysis and selection process: 
</p>
<ol>
<li>
Feature data, which are the direct output of FFT based analysis algorithms, and are stored by the SCMIR program (Nick Collins) on files of type .scmirZ. 
</li>
<li>
Onset data are an array of positions in the file which demarcate the beginnings of sound events, or separate perceptually distinct events. They are computed by SCMIR on the basis of previously extracted feature data. 
</li>
<li>
User-defined file segments, where each segment holds the onsets for the start and end of a sound file segment to be used in playback.
</li>
<li>
Other data (for later stages of this work here): Other extracted feature data (statistic means of significant features per section or per entire file etc.). These may include tags marking sets of onsets or sets of segments, as outlined in the data description section below.
</li>
<li>
Metadata holding details about the source of the analysis data: 
<ul>
<li>
Path of the source file
</li>
<li>
Parameters of the analysis process applied
</li>
<li>
Path of the primary analysis file
</li>
<li>
Other data: Length of file, number of channels, duration, sampling rate, etc. 
</li>
</ul>
</li>
</ol>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> User Interface Requirements: Preliminary Study </h2>
<div class="outline-text-2" id="text-4">


<p>
To use segments of sound files in a piece one needs to:
</p>
<ol>
<li>
Analyse the sound files and store the onset data. 
</li>
<li>
Define and name segments in each file, for later use in pieces.
</li>
<li>
Insert the names of the desired segments in the code of the piece. 
</li>
</ol>


<p>
Each of these steps is described in more detail below. 
</p>

</div>

<div id="outline-container-4_1" class="outline-3">
<h3 id="sec-4_1"><span class="section-number-3">4.1</span> Step 1: Analysis of the sound files </h3>
<div class="outline-text-3" id="text-4_1">


<p>
This step takes a set of one or more sound files as input and produces a set of analysis files containing both the primary feature data and the onset data. 
</p>
<ol>
<li>
Select a set of audio files (via one or more file-selection-dialogs). 
</li>
<li>
Select a folder to put the analysis data.
</li>
<li>
Press "GO". 
</li>
</ol>


<p>
All selected files are analysed. The analysis data are saved in the selected folder. 
</p>
<p>
Note: The current version of the present software analyses the sound files using the analysis configuration parameters given in an introductory example for onset detection in the SCMIR help files. Later an interface may be added to configure these parameters. 
</p>
</div>

</div>

<div id="outline-container-4_2" class="outline-3">
<h3 id="sec-4_2"><span class="section-number-3">4.2</span> Step 2: Define and name segments to work with </h3>
<div class="outline-text-3" id="text-4_2">


<p>
Segments are chosen interactively by clicking on separating lines indicating beginning and end of a segment. Each segment must be named by the user. Default names are provided by the system, e.g: "swallows<sub>1</sub>", "swallows<sub>2</sub>" etc. 
</p>
<p>
Note: The segments defined by the user are saved in the same file as the onset data for the same sound file. Segments for a group of analysis files residing in a folder can be later loaded at once for use in step 3 (Specify segments for use in a piece). 
</p>
</div>

</div>

<div id="outline-container-4_3" class="outline-3">
<h3 id="sec-4_3"><span class="section-number-3">4.3</span> Step 3: Specify segments by name to use in a piece </h3>
<div class="outline-text-3" id="text-4_3">



</div>

<div id="outline-container-4_3_1" class="outline-4">
<h4 id="sec-4_3_1"><span class="section-number-4">4.3.1</span> 3.1. Loading sound files and their segments </h4>
<div class="outline-text-4" id="text-4_3_1">


<p>
Given the onsets and segments for a group of files have been defined (in a previous work session), one starts by loading the segments of a group of files from a folder. 
</p>
</div>

</div>

<div id="outline-container-4_3_2" class="outline-4">
<h4 id="sec-4_3_2"><span class="section-number-4">4.3.2</span> 3.2. Selecting a segment from a file/segment list </h4>
<div class="outline-text-4" id="text-4_3_2">


<p>
A double list view can then be opened for selecting in the first view a sound file and then in the second view a segment from that sound file. 
</p>
</div>

</div>

<div id="outline-container-4_3_3" class="outline-4">
<h4 id="sec-4_3_3"><span class="section-number-4">4.3.3</span> 3.3. Inserting a segment as code for use in a piece </h4>
<div class="outline-text-4" id="text-4_3_3">


<p>
Once a segment is selected, code is generated for using it in a piece, and the code is copied in the background to the MacOS clipboard (using terminal command pbcopy). The user can then paste the generated code at any position in the code of a piece using the usual MacOS keyboard command (Command-V).  
</p>
<p>
The format of the code generated is: 
</p>



<pre class="example">FileSeg('filename', 'segmentname');
</pre>



<p>
A file segment can then be played by by sending it the message playFunc (for a Function) or playDef (for a SynthDef). For example: 
</p>



<pre class="example">FileSeg('filename', 'segmentname').playFunc({ | buf, start, end | PlayBuf.ar(....) });
</pre>



<p>
(Note: about the arguments buf, start, end, see Note 1 below.)
</p>
<p>
or: 
</p>



<pre class="example">FileSeg('filename', 'segmentname').playDef('defname' ... additional args); 
</pre>



<p>
Alternatively, its buffer and start and end positions can be obtained by message getParams. For example: 
</p>



<pre class="example">var buf, start, end;
#buf start, end = FileSeg('filename', 'segmentname').getParams;

Synth('playbuf', [\buf, buf, \start, start, \end, end]);
</pre>



<p>
Note 1: The arguments buf, start, end may be provided implicitly by using a UGen shortcut method added to this library, possibly Buffer:playSeg. 
</p>
<p>
Note 2: The method of copying code to the pasteboard will also be substituted for inserting buffer names in snippet code, instead of the currently used buffer menu scheme. 
</p>
</div>
</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Data Structures: First Draft </h2>
<div class="outline-text-2" id="text-5">


<p>
Preliminaries: 
</p>
<p>
For each analysed sound file there are two files produced: 
</p><ol>
<li>
The primary analysis file, called here feature data (fdf). This is produced by SCMIR as a result of the feature extraction process, and is of type .scmirZ.
(.scmirZ is a special type of binary for numerical data private to the SCMIR package).  
</li>
<li>
The file holding the onset data, the user-defined tags and segments and the meta-data. This is called "udf" for "user data file".  These data are saved in SuperCollider text archive format (sctxar). 
</li>
</ol>


<p>
Since one may want to use the primary feature data for further statistics of features at a later stage, the present approach keeps these 2 files (fdf, udf) in the same folder, together with the secondary analysis data (onsets, tags, metadata). For example, if one analyses a file called "swallows.aiff", then two files are produced and stored in the same folder: 
</p><ol>
<li>
FDF: swallows.scmirZ
</li>
<li>
UDF: swallows.sctxar
</li>
</ol>



</div>

<div id="outline-container-5_1" class="outline-3">
<h3 id="sec-5_1"><span class="section-number-3">5.1</span> Object structure of the user data </h3>
<div class="outline-text-3" id="text-5_1">


<p>
Each user data file (UDF) contains the following data items: 
</p>
<p>
Data group 1: Basic data
</p>
<ol>
<li>
Onset data (series of points segmenting the sound file)
</li>
<li>
Segment tags (set of named file segments, each marking the beginning and end of a segment, and accessible by its tag (a Symbol).
</li>
</ol>


<p>
Data group 2: Additional data
</p>
<ol>
<li>
Onset groups (set of tags, each marking a group of onsets)
</li>
<li>
Segment groups (set of tags, each marking a group of segments)
</li>
<li>
Metadata: Path of sound file, duration, number of channels etc. 
</li>
</ol>


<p>
The structure of the data items is as follows: 
</p>

</div>

<div id="outline-container-5_1_1" class="outline-4">
<h4 id="sec-5_1_1"><span class="section-number-4">5.1.1</span> Onset Data </h4>
<div class="outline-text-4" id="text-5_1_1">


<p>
The data defining a series of onsets (mark-points) dividing the sound into segments. 
</p>
</div>

</div>

<div id="outline-container-5_1_2" class="outline-4">
<h4 id="sec-5_1_2"><span class="section-number-4">5.1.2</span> Segment data </h4>
<div class="outline-text-4" id="text-5_1_2">


<p>
Dictonary of tags (symbols) associated to sound file segment  instances (FileSeg).
Basic instance variables of FileSeg are: 'start' and 'end', holding the start and end of the segment in seconds. 
</p>
</div>

</div>

<div id="outline-container-5_1_3" class="outline-4">
<h4 id="sec-5_1_3"><span class="section-number-4">5.1.3</span> Tag data (Optional, to be considered) </h4>
<div class="outline-text-4" id="text-5_1_3">


<p>
Dictonary of tags (symbols) associated to Onset instances.
This is an optional feature and will not be implemented at first. 
</p>
</div>

</div>

<div id="outline-container-5_1_4" class="outline-4">
<h4 id="sec-5_1_4"><span class="section-number-4">5.1.4</span> (Also optional, for later:) Onset group tags, Segment group tags </h4>
<div class="outline-text-4" id="text-5_1_4">


<p>
Onset Tags and Segment tags which apply to a group (set) of Onsets or Segments, instead of a single Onset or Segment. 
</p>
</div>

</div>

<div id="outline-container-5_1_5" class="outline-4">
<h4 id="sec-5_1_5"><span class="section-number-4">5.1.5</span> Metadata </h4>
<div class="outline-text-4" id="text-5_1_5">


<p>
The metadata are stored in an object of class SCMIRMetaData, which contains the following instance variables: 
</p>
<ul>
<li>
Path of the sound file analysed
</li>
<li>
Path of the primary feature data file resulting from the analysis
</li>
<li>
Timestamp of the analysis
</li>
<li>
Parameters of the analysis (array of specification parameters provided to SCMIR to perform the analysis). 
</li>
<li>
Size of file in frames
</li>
<li>
Durartion of sound
</li>
<li>
Sampling rate
</li>
<li>
Number of channels
</li>
</ul>


</div>
</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Draft of data and file / folder structures </h2>
<div class="outline-text-2" id="text-6">


<ul>
<li>
Start with a list "L" of files that are to be analysed.
</li>
<li>
At the beginning list L is empty.
</li>
<li>
Sound files are added to this list incrementally, one by one or in batches (groups)
</li>
<li>
Sound files in a list can reside in different folders (the sound files to be analysed do not have to be in the same folder). 
</li>
<li>
The analysis data of list l are collected in a single "top folder" referred to here as "FF" (Feature Folder). 
</li>
<li>
The FF contains analysis data for a list of sound files.
</li>
<li>
For each sound file SF in the list, two files are stored in FF:
<ol>
<li>
A file of type .scmirZ, containing the feature data from SCMIR analysis, for later reference
</li>
<li>
A file of type .sctxar, containing the onsets as well as tags and metadata.
</li>
</ol>
</li>
<li>
The feature data and onset data files are named after the name of the feature data that it contains. For example: 
</li>
</ul>


<p>
Given a sound file "swallows1.aiff", that belongs to a list L with an analysis top folder TF, an analysis folder SFF is created inside the top folder TF. The name of the SFF is "swallows1". Inside the folder "swallows1", several files can be added, where each folder is named after the feature whose data it contains. So the structure of the top folder TF will be: 
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">Top folder:</td><td class="left">FF</td></tr>
<tr><td class="left">File with the feature data:</td><td class="left">swallows1.scrmirZ</td></tr>
<tr><td class="left">File containing the onsets, tags and metadata</td><td class="left">swallows1.sctxar</td></tr>
</tbody>
</table>




</div>
</div>
<div id="postamble">
<p class="author"> Author: I Z
</p>
<p class="date"> Date: 2012-12-30 15:28:03 EET</p>
<p class="creator">HTML generated by org-mode 7.4 in emacs 23</p>
</div>
</div>
</body>
</html>
